import * as React from 'react';
import * as L from '@korus/leda';
import { componentSrc } from './index';

/* eslint-disable react/no-unescaped-entities */
export const PredefinedValidators = {
  liveDemo: `
const PredefinedValidators = () => {
  return (
    <>
      <L.Input
        name="field1"
        form="myForm"
        isRequired
        validator="inn"
        _width-30
      />
      <br /><br />
      <L.Button
        form="myForm"
        onClick={() => alert('success')}
      >
        Submit
      </L.Button>
    </>
  );
};

render(<PredefinedValidators />);
`,
  text: (
    <L.Div _inner>
      <L.P>
        Есть несколько готовых валидаторов:
      </L.P>
      <L.Ul _txt-list>
        <li>
          <L.P>
            <b>cadastralNumber</b> - кадастровый номер
          </L.P>
          <L.P>
            Валидацию пройдёт только значение в формате кадастрового номера: 47:14:1203001:814
          </L.P>
        </li>
        <li>
          <L.P>
            <b>email</b> - электронная почта
          </L.P>
          <L.P>
            Валидацию пройдет только значение в формате электронной почты: foo@example.com
          </L.P>
        </li>
        <li>
          <L.P>
            <b>inn</b> - ИНН (идентификационный номер налогоплательщика) физических и юридических лиц
          </L.P>
          <L.P>
            Валидацию пройдет только значение в формате ИНН физического или юридического лица: 7801392271 / 470707900932
          </L.P>
        </li>
        <li>
          <L.P>
            <b>innCorp</b> - ИНН (идентификационный номер налогоплательщика) юридических лиц
          </L.P>
          <L.P>
            Валидацию пройдет только значение в формате ИНН юридического лица: 7801392271
          </L.P>
        </li>
        <li>
          <L.P>
            <b>innPrivate</b> - ИНН (идентификационный номер налогоплательщика) физических лиц
          </L.P>
          <L.P>
            Валидацию пройдет только значение в формате ИНН физического лица: 470707900932
          </L.P>
        </li>
        <li>
          <L.P>
            <b>ogrn</b> - ОГРН (Основной государственный регистрационный номер)
          </L.P>
          <L.P>
            Валидирует ОГРН по контрольному числу (пример ОГРН: 1037739169335)
          </L.P>
        </li>
        <li>
          <L.P>
            <b>ogrnIp</b> - ОГРНИП (Основной государственный регистрационный номер индивидуального предпринимателя)
          </L.P>
          <L.P>
            Валидирует ОГРН по контрольному числу (пример ОГРНИП: 317798096945129)
          </L.P>
        </li>
        <li>
          <L.P>
            <b>postalCode</b> - электронная почта
          </L.P>
          <L.P>
            Валидацию пройдет только значение в формате почтового индекса: 195196
          </L.P>
        </li>
        <li>
          <L.P>
            <b>snils</b> - СНИЛС (Страховой номер индивидуального лицевого счёта)
          </L.P>
          <L.P>
            Валидирует СНИЛС по чек-сумме, принимает разные форматы: числовой, строковый (123-456-789 64)
          </L.P>
        </li>
      </L.Ul>
    </L.Div>
  ),
  source: componentSrc,
};
